Repository: wangzq/dnSpy
Catalog: dnSpy/Properties/dnSpy.Resources.*.resx
Languages: ru

# About_Issues
source: _Issues
ru: _Задачи

# About_LatestBuild
source: Latest _Build
ru: П_оследний билд

# About_LatestRelease
source: _Latest Release
ru: _Последний релиз

# About_Menu
source: _About
ru: О_ программе

# About_SourceCode
source: _Source Code
ru: _Исходный код

# About_TabTitle
source: About
ru: О программе

source: All Files
ru: Все файлы

# AssemblyExplorerCommand
source: Assembly Ex_plorer
ru: Обозреватель _сборок

# AssemblyExplorerTitle
source: Assembly Explorer
ru: Обозреватель сборок

# BaseTypeFolder
source: Base Type and Interfaces
ru: Базовый тип и интерфейсы

# Button_Cancel
source: _Cancel
ru: _Отмена

# Button_No
source: _No
ru: _Нет

# Button_Save
source: _Save...
ru: _Сохранить...

# Button_SaveCode
source: _Save Code...
ru: _Сохранить код...

# Button_Yes
source: _Yes
ru: _Да

# CantConvertInputToType
source: Can't convert the input to the desired type: {0}
ru: Не удается преобразовать входные данные в требуемый тип: {0}

# CloseAllTabGroupsButThisCommand
source: Close All Tab Groups But This
ru: Закрыть все группы вкладок, кроме этой

# CloseAllTabsButThisCommand
source: Close _All But This
ru: Закрыть _все, кроме текущей

# CloseAllTabsCommand
source: C_lose All Tabs
ru: З_акрыть все вкладки

# CloseTabCommand
source: _Close
ru: _Закрыть

# CloseTabGroupCommand
source: Close Tab Group
ru: Закрыть группу вкладок

# CopyCommand
source: Cop_y
ru: _Копировать

# CopyMDTokenCommand
source: _Copy MD Token
ru: _Копировать токен метаданных

source: Could not start browser
ru: Не могу запустить браузер

# DecompilationCanceled
source: The operation was canceled
ru: Операция отменена

# DecompilationException
source: An error occurred
ru: Произошла ошибка

# DecompileCancelButton
source: Cancel
ru: Отмена

source: Decompiling...
ru: Декомпиляция...

source: Derived Types
ru: Дочерние типы

# DisplayDlgTabTitle
source: Display
ru: Отображение

# DotNetExes
source: .NET Executables
ru: Исполняемые файлы .NET

# EmptyTabTitle
source: <empty>
ru: <пусто>

# ExceptionMessage
source: An exception occurred:
ru: Произошло исключение:

# ExitAppCommand
source: E_xit
ru: В_ыход

# ExplorerOpenWithDnSpy
source: Open with dnSpy
ru: Открыть с помощью dnSpy

# FindCommand
source: _Find
ru: _Найти

# FindCommand2
source: Find
ru: Найти

# FullScreenCommand
source: F_ull Screen
ru: П_олный экран

# FullScreenToolBarCommand
source: Full Screen
ru: Во весь экран

# GoToEntryPointCommand
source: Go to _Entry Point
ru: Перейти к _точке входа

# GoToGlobalCctorCommand
source: Go to <Module> .ccto_r
ru: Перейти к <Module> .ccto_r

# GoToLine_EnterLineNum
source: Enter a line number
ru: Введите номер строки

# GoToLine_InvalidLine
source: Invalid line: {0}
ru: Недопустимая строка: {0}

# GoToLine_Label
source: _Line [, column]
ru: _Строка [, столбец]

# GoToLine_Title
source: Go to Line
ru: Перейти к строке

# GoToReferenceCommand
source: Go to Reference
ru: Перейти по ссылке

# GoToReferenceKey
source: Dbl Click
ru: Двойной клик

# GoToTokenCommand
source: Go to M_D Token...
ru: Перейти к токену мета_данных...

# GoToToken_CouldNotResolve
source: Could not resolve member reference token: 0x{0:X8}
ru: Не могу определить токен ссылки: 0x{0:X8}

# GoToToken_InvalidToken
source: Invalid metadata token: 0x{0:X8}
ru: Неверный токен метаданных: 0x{0:X8}

# GoToToken_Label
source: _Metadata token
ru: Токен _метаданных

# GoToToken_Title
source: Go to MD Token
ru: Перейти к токену метаданных

# HideAllToolWindowsCommand
source: H_ide All Tabs
ru: Ск_рыть все вкладки

# HideToolWindowCommand
source: _Hide
ru: _Скрыть

# HighlightLine
source: _Highlight Current Line
ru: П_одсветить текущую строку

# InvalidInputTextMessageBox
source: The text is invalid
ru: Неверный текст

source: Loading dnSpy. Please wait...
ru: Загрузка dnSpy. Пожалуйста, подождите...

# Menu_Edit
source: _Edit
ru: _Правка

# Menu_File
source: _File
ru: _Файл

# Menu_Help
source: _Help
ru: _Помощь

# Menu_Themes
source: _Themes
ru: _Темы

# Menu_View
source: _View
ru: _Вид

# Menu_Windows
source: _Window
ru: _Окно

# MergeAllTabGroupsCommand
source: Merge All Tab Groups
ru: Объединить все группы вкладок

# MessageBoxDontShowAgain
source: _Don't show again
ru: _Больше не показывать

# MoveAllTabsToNextTabGroupCommand
source: Move All to Next Tab Group
ru: Перенести все в следующую группу вкладок

# MoveAllToPreviousTabGroupCommand
source: Move All to Previous Tab Group
ru: Перенести все в предыдущую группу вкладок

# MoveBottomCommand
source: _Bottom
ru: В_низ

# MoveLeftCommand
source: _Left
ru: В_лево

# MoveRightCommand
source: _Right
ru: В_право

# MoveTabGroupAfterNextTabGroupCommand
source: Move Tab Group After Next Tab Group
ru: Переместить группу вкладок после следующей

# MoveTabGroupBeforePreviousTabGroupCommand
source: Move Tab Group Before Previous Tab Group
ru: Переместить группу вкладок перед предыдущей

# MoveToNextTabGroupCommand
source: Move to Ne_xt Tab Group
ru: Переместить в _следующую группу вкладок

# MoveToolWindowCommand
source: _Move
ru: _Переместить

# MoveToolWindowGroupCommand
source: Move _Group
ru: Переместить _группу

# MoveTopCommand
source: _Top
ru: В_верх

# MoveToPreviousTabGroupCommand
source: Move to P_revious Tab Group
ru: Переместить в _предыдущую группу вкладок

# NavigateBackCommand
source: Navigate Backward (Backspace)
ru: Перейти назад (Backspace)

# NavigateForwardCommand
source: Navigate Forward (Alt+Right)
ru: Перейти вперед (Alt+Right)

# NewDataIsNotAnImage
source: The new data is not an image.
ru: Новые данные не являются картинкой.

# NewHorizontalTabGroupCommand
source: New Hori_zontal Tab Group
ru: Новая _горизонтальная группа вкладок

# NewTabCommand
source: New _Tab
ru: Новая _вкладка

# NewVerticalTabGroupCommand
source: New _Vertical Tab Group
ru: Новая _вертикальная группа вкладок

# NewWindowCommand
source: _New Window
ru: _Новое окно

# OpenCommand
source: _Open...
ru: _Открыть...

# OpenContainingFolderCommand
source: _Open Containing Folder
ru: _Открыть каталог

# OpenGACCommand
source: Open from _GAC...
ru: Открыть из _GAC...

# OpenGAC_CreatedBy_Label
source: Created by:
ru: Создано:

# OpenGAC_FileVersion_Label
source: File Version:
ru: Версия файла:

# OpenGAC_Name_Column
source: Name
ru: Имя

# OpenGAC_Name_Label
source: Name:
ru: Имя:

# OpenGAC_Path_Label
source: Path:
ru: Путь:

# OpenGAC_ShowDupes_CheckBox
source: _Show duplicates
ru: _Показывать дубликаты

# OpenGAC_ShowFiles
source: Showing {0:n0} of {1:n0} files
ru: Показано {0:n0} из {1:n0} файлов

# OpenGAC_Title
source: Open from GAC
ru: Открыть из GAC

# OpenGAC_Version_Column
source: Version
ru: Версия

# OpenGAC_Version_Label
source: Version:
ru: Версия:

# OpenInNewTabCommand
source: Open in New _Tab
ru: Открыть новую _вкладку

# OpenListCommand
source: Open L_ist...
ru: Открыть сп_исок...

# OpenList_AskForName
source: _Name
ru: _Имя

# OpenList_Files_Column
source: Files
ru: Файлы

# OpenList_MissingName
source: Missing name
ru: Имя пропущено

# OpenList_Name_Column
source: Name
ru: Имя

# OpenList_New_Button
source: _New...
ru: _Новый...

# OpenList_Open_Button
source: _Open
ru: _Открыть

# OpenList_Remove_Button
source: _Remove
ru: _Убрать

# OpenList_SavedLists_CheckBox
source: S_aved lists
ru: С_охраненные списки

# OpenList_Search_Label
source: _Search
ru: _Поиск

# OpenList_Title
source: Open List
ru: Открыть список

# OpenToolBarToolTip
source: Open (Ctrl+O)
ru: Открыть (Ctrl+O)

# OptionsTitle
source: Options
ru: Настройки

# Options_Misc_Button_EnableAllWarnings
source: Enable all warning messages
ru: Включить все предупреждения

# Options_Misc_Deserialize
source: Deserialize types in resources (unsafe)
ru: Десериализовывать типы в ресурсах (небезопасно)

# Options_Misc_Deserialize_ToolTip
source: Any assembly could get loaded and executed with data from the resources.
ru: Любая сборка может быть загружена и выполнена с данными из ресурсов.

# Options_Misc_ExplorerIntegration
source: Windows Explorer Integration
ru: Интеграция с Windows Explorer

# Options_Misc_ExplorerIntegration_ToolTip
source: Adds a context menu entry to Windows Explorer to open assemblies in dnSpy
ru: Добавить пункт открытия сборок через dnSpy в контекстное меню Windows Explorer

# Options_Misc_UseMmapdIO
source: Use memory mapped I/O
ru: Использовать отображаемый в память ввод/вывод

# Options_Misc_UseMmapdIO_ToolTip
source: Can be disabled per module if you right-click it.
ru: Может быть выключено для модуля, если дважды кликнуть.

# ReferencesFolder
source: References
ru: Ссылки

# ReloadAsmsCommand
source: _Reload All Assemblies
ru: _Перегрузить все сборки

# ResourcesFolder
source: Resources
ru: Ресурсы

# SaveResourceButton
source: Save
ru: Сохранить

# SavingCode
source: Saving...
ru: Сохранение...

# SearchAbortedMessage
source: Search aborted, more than {0:n0} results found.
ru: Поиск остановлен, найдено более {0:n0} результатов.

# SearchAssembliesCommand
source: _Search Assemblies
ru: _Искать в сборках

# SearchAssembliesToolBarToolTip
source: Search Assemblies (Ctrl+K)
ru: Искать в сборках (Ctrl+K)

source: Searching...
ru: Поиск...

# SearchMsdnCommand
source: Search _MSDN
ru: Искать в _MSDN

# SearchWindow_Options
source: Options
ru: Настройки

# SearchWindow_SearchFor
source: Search For:
ru: Искать:

# ShowCodeCommand
source: _Code
ru: _Код

# SyntaxHighlightCommand
source: Syntax Highlight
ru: Подсветка синтаксиса

# TabsDlg_Activate_Button
source: _Activate
ru: _Активировать

# TabsDlg_CloseWindow_Button
source: _Close Window
ru: _Закрыть окно

# TabsDlg_Module_Column
source: Module
ru: Модуль

# TabsDlg_Name_Column
source: Name
ru: Имя

# TabsDlg_Path_Column
source: Path
ru: Путь

# TabsDlg_Title
source: Windows
ru: Окна

# TextEditorNewFormatterWarningMsg
source: The text editor is using the new faster text formatter. It doesn't support word wrap or all unicode characters. Enable/disable it in the options.
ru: Текстовый редактор использует новый быстрый форматтер. Он не поддерживает перенос слов и все символы unicode. Можете включить/выключить это в настройках.

# UnknownError
source: An unknown error occurred
ru: Возникла неизвестная ошибка

# UseHorizontalTabGroupsCommand
source: Use Horizontal Tab Groups
ru: Использовать горизонтальные группы вкладок

# UseVerticalTabGroupsCommand
source: Use Vertical Tab Groups
ru: Использовать вертикальные группы вкладок

# WindowsCommand
source: _Windows...
ru: _Окна...

# WordWrapHeader
source: _Word Wrap
ru: _Перенос слов

# CloseTabButtonToolTip
source: Close
ru: Закрыть

# DisplaySettings_DecompileType
source: Decompile the full type instead of a single member
ru: Декомпилировать весь тип вместо одного члена типа

# DisplaySettings_HighlightReferences
source: Highlight references
ru: Выделить ссылки

# DisplaySettings_RestoreTabs
source: Restore tabs at startup
ru: Восстановить вкладки при запуске

# DisplaySettings_ShowAssemblyPublicKeyToken
source: Show assembly public key token
ru: Показать публичный ключ сборки

# DisplaySettings_ShowAssemblyVersion
source: Show assembly version
ru: Показать информацию о сборке

# DisplaySettings_ShowLineNumbers
source: Show line numbers
ru: Показать количество строк

# DisplaySettings_ShowTokens
source: Show metadata tokens
ru: Показать токены метаданных

# DisplaySettings_SingleClickExpandNodes
source: Single-click expands TreeView nodes
ru: Разворачивать узлы дерева одним кликом

# DisplaySettings_SyntaxHighlightTreeView
source: Syntax highlight TreeView
ru: Синтаксическая подсветка в дереве

source: Font
ru: Шрифт

# MiscDlgTabTitle
source: Misc
ru: Остальное

# OptionsCommand
source: _Options...
ru: _Параметры...

# SearchWindow_AllAbove
source: All of the Above
ru: Все возможное

# SearchWindow_Assembly
source: Assembly
ru: Сборки

# SearchWindow_AssemblyRef
source: AssemblyRef
ru: Ссылки на сборки

# SearchWindow_CaseSensitiveSearch
source: Case Sensitive Search
ru: Регистрозависимый поиск

# SearchWindow_Class
source: Class
ru: Классы

# SearchWindow_DecompileResources
source: Decompile Resources (eg. XAML)
ru: Декомпилировать ресурсы (пр. XAML)

# SearchWindow_Delegate
source: Delegate
ru: Делегаты

# SearchWindow_Enum
source: Enum
ru: Перечисления

# SearchWindow_Event
source: Event
ru: События

# SearchWindow_Field
source: Field
ru: Поля

# SearchWindow_Generic
source: Generic Type
ru: Обобщенные типы

# SearchWindow_Interface
source: Interface
ru: Интерфейсы

# SearchWindow_Literal
source: Number/String
ru: Числа/строки

# SearchWindow_Local
source: Local
ru: Локальные переменные

# SearchWindow_MatchAny
source: Match Any Search Term
ru: Совпадение с любым словом

# SearchWindow_MatchWholeWords
source: Match Whole Words
ru: Только полные совпадения слов

# SearchWindow_Member
source: Member
ru: Член

# SearchWindow_Method
source: Method
ru: Метод

# SearchWindow_Module
source: Module
ru: Модуль

# SearchWindow_ModuleRef
source: ModuleRef
ru: Ссылки на модуль

# SearchWindow_Namespace
source: Namespace
ru: Пространства имен

# SearchWindow_NonGeneric
source: Non-Generic Type
ru: Необобщенные типы

# SearchWindow_Parameter
source: Parameter
ru: Параметры

# SearchWindow_ParameterLocal
source: Parameter/Local
ru: Параметры/Локальные переменные

# SearchWindow_Property
source: Property
ru: Свойство

# SearchWindow_Resource
source: Resource
ru: Ресурс

# SearchWindow_Struct
source: Struct
ru: Структура

# SearchWindow_Title
source: Search
ru: Поиск

# SearchWindow_Type
source: Type
ru: Тип

# ToolWindowWinPosButtonToolTip
source: Window Position
ru: Позиция окна

# UseNewRendererHeader
source: Use the new text formatter
ru: Использовать новый форматтер

# UseNewRendererInfo
source: The new text formatter is faster but doesn't support word wrap or all unicode characters.
ru: Новый форматтер быстрее старого, но не поддерживает перенос слов и все символы unicode.

# UseNewRenderer_FileTreeView
source: File TreeView
ru: Дерево файлов

# UseNewRenderer_HexEditor
source: Hex Editor
ru: Редактор Hex

# UseNewRenderer_TextEditor
source: Text Editor
ru: Текстовый редактор

# DisplaySettings_OtherOptions
source: Other Options
ru: Остальные настройки

# Theme_Blue
source: _Blue
ru: _Синяя

# Theme_Dark
source: _Dark
ru: _Темная

# Theme_HighContrast
source: _High Contrast
ru: _Высокая контрастность

# Theme_Light
source: _Light
ru: С_ветлая

# OpenGAC_Search_ToolTip
source: Search (Ctrl+E or Ctrl+F)
ru: Поиск (Ctrl+E или Ctrl+F)

# LanguageCommand
source: Language
ru: Язык

# Language_OperatingSystemLanguage
source: System
ru: Системный

# LanguageSwitchMessage
source: You must restart dnSpy for the language change to take effect.
ru: Для использования нового языка вы должны перезапустить dnSpy.

# SortAsmsCommand
source: Sor_t Assemblies
ru: Сор_тировать сборки

# AskReadSettings
source: Do you want to load the saved settings?
ru: Вы хотите загрузить сохраненные настройки?

# ExportToProjectCommand
source: Export to Pro_ject...
ru: Экспорт в Про_ект...

# ExportToProject_Title
source: Export to Project
ru: Экспорт в проект

# Error_FileAlreadyExists
source: A file with the same name as the destination folder already exists.
ru: Файл с таким же именем как и каталог уже существует.

# Error_MissingDestinationFolder
source: Missing destination folder.
ru: Не указан выходной каталог.

# ExportToProject_Button_Export
source: _Export
ru: _Экспорт

# ExportToProject_CreateResX
source: Create .res_x files
ru: Создать файлы .res_x

# ExportToProject_DecompileXaml
source: Decompile _baml to xaml
ru: Декомпилировать _baml в xaml

# ExportToProject_DestinationFolder
source: _Folder
ru: _Каталог

# ExportToProject_DontReferenceStdLib
source: _Do not reference mscorlib.dll
ru: _Не ссылаться на mscorlib.dll

# ExportToProject_ExportFileMessage
source: One file will be decompiled. Select more than one assembly to decompile more than one file.
ru: Будет декомпилирован один файл. Для того, чтобы декомпилировать больше файлов, выберите больше сборок.

# ExportToProject_ExportNFilesMessage
source: {0:n0} files will be decompiled.
ru: Будет декомпилировано {0:n0} файлов.

# ExportToProject_Language
source: _Language
ru: _Язык

# ExportToProject_OpenProjectInVisualStudio
source: _Open project in Visual Studio
ru: _Открыть проект в Visual Studio

# ExportToProject_ProjectVersion
source: _Version
ru: _Версия

# ExportToProject_SolutionFilename
source: _Solution
ru: _Решение

# ExportToProject_UnpackResources
source: _Unpack resources
ru: _Распаковать ресурсы

# Error_MissingFilename
source: Missing filename
ru: Пропущено имя файла

# Button_Close
source: _Close
ru: _Закрыть

# ErrorExceptionOccurred
source: An exception occurred {0}
ru: Произошло исключение {0}

# ExportToProject_ErrorLogMsg
source: Error log
ru: Журнал ошибок

# DecompilerDlgTabTitle
source: Decompiler
ru: Декомпилятор

# DisplaySettings_MemberOrder
source: TreeView member order (restart needed)
ru: Порядок членов в дереве (перезапуск)

# MemberKind_Events
source: Events
ru: События

# MemberKind_Fields
source: Fields
ru: Поля

# MemberKind_Methods
source: Methods
ru: Методы

# MemberKind_NestedTypes
source: Nested Types
ru: Вложенные типы

# MemberKind_Properties
source: Properties
ru: Свойства

# AboutScreen_LicenseInfo
source: dnSpy is licensed under GPLv3.
ru: dnSpy лицензирован GPLv3.

# AboutScreen_LoadedFiles
source: Loaded files:
ru: Загруженные файлы:

# SearchWindow_SearchGacAssemblies
source: Search in GAC assemblies
ru: Искать в сборках GAC

# SearchWindow_Where_AllFiles
source: All Files
ru: Все файлы

# SearchWindow_Where_FilesInSameFolder
source: Files in Same Folder
ru: Файлы в том же каталоге

# SearchWindow_Where_SelectedFiles
source: Selected Files
ru: Выбранные файлы

# SearchWindow_Where_SelectedType
source: Selected Type
ru: Выбранный тип

# GoToResourceCommand
source: Go to Re_source
ru: Перейти к ре_сурсу

# CollapseTreeViewNodesCommand
source: Collapse Tree_View Nodes
ru: Свернуть узлы _дерева

# CloseAllCommand
source: Close All
ru: Закрыть все

# ExportToProject_NewGuid
source: _New
ru: _Новый

# ExportToProject_ProjectGuid
source: _Project GUID
ru: _GUID проекта
